docs(calling): address review comments
